- Generally ML models Developed by maths
- Convert categorical column to Numerical columns
- Here we are transform the data
- This method is called **Encoding**
- Feature Analysis:first 5 sessions
- Feature Endineering:Transform the data
- Ferature selection:Machine learning

- Before Model Development
- We will do EDA : Exploratary data analysis
   - Features(columns) analysis
     - categorical,Numerical ,Outlier analysis,Bivariate,Multivariate
     - We will get the insights

 - Ferature Engineering
   - we will modify the data
   - Models developed by maths
   - Encoding:Convert categorical data to Numerical Variables
   - Scaling:All the numerical columns makes under one scale
   - Transformations:All the maths developed by assumption data follows Normal distribution
     - convert skewec distribution to Normal

- Feature selection

**Methods**

- map
- LabelEncoder
- OneHotEncoder

In [9]:
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

import pandas as pd
path=r"C:\Users\jagar\Documents\Visadataset.csv"
visa_df=pd.read_csv(path)
cat=visa_df.select_dtypes(include='object').columns
num=visa_df.select_dtypes(exclude='object').columns

In [10]:
visa_df

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,Denied
3,EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,Denied
4,EZYV05,Africa,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,Certified
...,...,...,...,...,...,...,...,...,...,...,...,...
25475,EZYV25476,Asia,Bachelor's,Y,Y,2601,2008,South,77092.5700,Year,Y,Certified
25476,EZYV25477,Asia,High School,Y,N,3274,2006,Northeast,279174.7900,Year,Y,Certified
25477,EZYV25478,Asia,Master's,Y,N,1121,1910,South,146298.8500,Year,N,Certified
25478,EZYV25479,Asia,Master's,Y,Y,1918,1887,West,86154.7700,Year,Y,Certified
25479,EZYV25480,Asia,Bachelor's,Y,N,3195,1960,Midwest,70876.9100,Year,Y,Certified

In [25]:
# check how many unique values available
visa_df['case_status'].unique()

array([1, 0])

In [26]:
# create a dictionary assign a number start with zero
# for each labels baesd on alphabetical oredr
d={'Certified':0,'Denide':1}
d

{'Certified': 0, 'Denide': 1}

In [27]:
import pandas as pd
path=r"C:\Users\jagar\Documents\Visadataset.csv"
visa_df=pd.read_csv(path)
visa_df

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,Denied
3,EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,Denied
4,EZYV05,Africa,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,Certified
...,...,...,...,...,...,...,...,...,...,...,...,...
25475,EZYV25476,Asia,Bachelor's,Y,Y,2601,2008,South,77092.5700,Year,Y,Certified
25476,EZYV25477,Asia,High School,Y,N,3274,2006,Northeast,279174.7900,Year,Y,Certified
25477,EZYV25478,Asia,Master's,Y,N,1121,1910,South,146298.8500,Year,N,Certified
25478,EZYV25479,Asia,Master's,Y,Y,1918,1887,West,86154.7700,Year,Y,Certified
25479,EZYV25480,Asia,Bachelor's,Y,N,3195,1960,Midwest,70876.9100,Year,Y,Certified

In [28]:
# map the dictionary with column
visa_df['case_status']=visa_df['case_status'].map(d)

In [29]:
visa_df

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,NaN
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,0.0
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,NaN
3,EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,NaN
4,EZYV05,Africa,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...
25475,EZYV25476,Asia,Bachelor's,Y,Y,2601,2008,South,77092.5700,Year,Y,0.0
25476,EZYV25477,Asia,High School,Y,N,3274,2006,Northeast,279174.7900,Year,Y,0.0
25477,EZYV25478,Asia,Master's,Y,N,1121,1910,South,146298.8500,Year,N,0.0
25478,EZYV25479,Asia,Master's,Y,Y,1918,1887,West,86154.7700,Year,Y,0.0
25479,EZYV25480,Asia,Bachelor's,Y,N,3195,1960,Midwest,70876.9100,Year,Y,0.0

In [30]:
path=r"C:\Users\jagar\Documents\Visadataset.csv"
visa_df=pd.read_csv(path)
visa_df['case_status'].unique()
d={'Certified':0,'Denide':1}
visa_df['case_status']=visa_df['case_status'].map(d)

In [31]:
visa_df['case_status']

0        NaN
1        0.0
2        NaN
3        NaN
4        0.0
        ...
25475    0.0
25476    0.0
25477    0.0
25478    0.0
25479    0.0
Name: case_status, Length: 25480, dtype: float64

In [18]:
labels=sorted(visa_df['continent'].unique())
#d={}
#for i in range(len(labels)):
   # keys=labels[i]
    #d[keys]=i
d={labels[i]:i for i in range(len(labels))}
d

{'Africa': 0,
 'Asia': 1,
 'Europe': 2,
 'North America': 3,
 'Oceania': 4,
 'South America': 5}

In [19]:
labels=sorted(visa_df['continent'].unique())
d={labels[i]:i for i in range(len(labels))}
d

{'Africa': 0,
 'Asia': 1,
 'Europe': 2,
 'North America': 3,
 'Oceania': 4,
 'South America': 5}

In [20]:
import pandas as pd
path=r"C:\Users\jagar\Documents\Visadataset.csv"
visa_df=pd.read_csv(path)
cat=visa_df.select_dtypes(include='object').columns
for i in cat:
    labels=sorted(visa_df[i].unique())
    d={labels[i]:i for i in range(len(labels))}
    visa_df[i]=visa_df[i].map(d)
visa_df

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,0,1,2,0,0,14513,2007,4,592.2029,0,1,1
1,1,1,3,1,0,2412,2002,2,83425.6500,3,1,0
2,2,1,0,0,1,44444,2008,4,122996.8600,3,1,1
3,3,1,0,0,0,98,1897,4,83434.0300,3,1,1
4,4,0,3,1,0,1082,2005,3,149907.3900,3,1,0
...,...,...,...,...,...,...,...,...,...,...,...,...
25475,17204,1,0,1,1,2601,2008,3,77092.5700,3,1,0
25476,17205,1,2,1,0,3274,2006,2,279174.7900,3,1,0
25477,17206,1,3,1,0,1121,1910,3,146298.8500,3,0,0
25478,17207,1,3,1,1,1918,1887,4,86154.7700,3,1,0
25479,17209,1,0,1,0,3195,1960,1,70876.9100,3,1,0

**LabelEncoder**

- package name:**sklearn**
  - class:**preprocessing**
    - method:**LabelEncoder**

- from sklearn.preprocessing import LabelEncoder

- step-1:import the method
- step-2:save the method
- step-3:apply fit transform

**fit transform**
- fit:finding something
    - first we are finding something
- transform:change the data
    - using the dictionary we are changing Eng to Number

In [21]:
from sklearn.preprocessing import LabelEncoder
path=r"C:\Users\jagar\Documents\Visadataset.csv"
visa_df=pd.read_csv(path)

le=LabelEncoder()
visa_df['case_status']=le.fit_transform(visa_df['case_status'])

In [22]:
from sklearn.preprocessing import LabelEncoder
path=r"C:\Users\jagar\Documents\Visadataset.csv"
visa_df=pd.read_csv(path)
le=LabelEncoder()
for i in cat:
    visa_df[i]=le.fit_transform(visa_df[i])

In [23]:
visa_df

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,0,1,2,0,0,14513,2007,4,592.2029,0,1,1
1,1,1,3,1,0,2412,2002,2,83425.6500,3,1,0
2,2,1,0,0,1,44444,2008,4,122996.8600,3,1,1
3,3,1,0,0,0,98,1897,4,83434.0300,3,1,1
4,4,0,3,1,0,1082,2005,3,149907.3900,3,1,0
...,...,...,...,...,...,...,...,...,...,...,...,...
25475,17204,1,0,1,1,2601,2008,3,77092.5700,3,1,0
25476,17205,1,2,1,0,3274,2006,2,279174.7900,3,1,0
25477,17206,1,3,1,0,1121,1910,3,146298.8500,3,0,0
25478,17207,1,3,1,1,1918,1887,4,86154.7700,3,1,0
25479,17209,1,0,1,0,3195,1960,1,70876.9100,3,1,0

**OneHotEncoder**

- The method name is: pd.get_dummies

|case_status|case_status_Denied|case_status_Certified|
|-|-|-|
|Denied|1|0|
|Certified|0|1|

In [3]:
import pandas as pd
path=r"C:\Users\jagar\Documents\Visadataset.csv"
visa_df=pd.read_csv(path)
pd.get_dummies(visa_df['continent'],
              dtype='int',columns=None)

       Africa  Asia  Europe  North America  Oceania  South America
0           0     1       0              0        0              0
1           0     1       0              0        0              0
2           0     1       0              0        0              0
3           0     1       0              0        0              0
4           1     0       0              0        0              0
...       ...   ...     ...            ...      ...            ...
25475       0     1       0              0        0              0
25476       0     1       0              0        0              0
25477       0     1       0              0        0              0
25478       0     1       0              0        0              0
25479       0     1       0              0        0              0

[25480 rows x 6 columns]

**LabelEncoder vs OneHotEncoder**

- Generally we dont want a relation between input columns
- we need both aput columns are not correlated each other
- we need both input columns are **independent(X,Y)** each other
- we need both input columns are **perpendicular** each other
- we need both input columns are **Orthogonal** each other
- we need both input columns are **90 degrees phase shift** each other
- OneHotEncoder will achieve above
- But OneHotEncoder creates new columns
    - columns are incraese means dimensions are incresae
    - More dimension data need more processing time
    - More dimension data need more infra
    - This is called **Curse of Dimensionality**.